Revit 2027 API
DuctFittingAndAccessoryData.GetAllConnectorData Method
 Gets the connector data of the pipe fitting or pipe accessory.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<DuctFittingAndAccessoryConnectorData> GetAllConnectorData()
Public Function GetAllConnectorData As IList(Of DuctFittingAndAccessoryConnectorData)
public:
IList<DuctFittingAndAccessoryConnectorData^>^ GetAllConnectorData()
member GetAllConnectorData : unit -> IList<DuctFittingAndAccessoryConnectorData>
Return Value
IList<DuctFittingAndAccessoryConnectorData>
 All connector data.
Remarks
 DuctFittingAndAccessoryConnectorData contains connector data which is needed to calculate coefficient. such as width, height, diameter and flow.
See Also
Reference
DuctFittingAndAccessoryData Class
Autodesk.Revit.DB.Mechanical Namespace